;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№10. Определите функцию, осуществляющую удаление указанного количества по-	;
;;;следних элементов исходного списка.						;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun delete-end(list)                      
  (cond	((null (cdr list)) nil)                        
		(t ( cons (car list) (delete-end (cdr list)) ))
  )
)
(defun delete-last-n(list n)
 (cond 	((> n 1) (delete-last-n (delete-end list) (1- n) ))
		((= n 1) (delete-end list))
		(t list)
 )
)


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(delete-last-n '(1 2 3 4 5) 0)	; (1 2 3 4 5)
(delete-last-n '(1 2 3 4 5) 1)	; (1 2 3 4)
(delete-last-n '(1 2 3 4 5) 2)	; (1 2 3)
(delete-last-n '(1 2 3 4 5) 3)	; (1 2)
(delete-last-n '(1 2 3 4 5) 4)	; (1)
(delete-last-n '(1 2 3 4 5) 5)	; NIL
(delete-last-n '(1 2 3 4 5) 6)	; NIL
(delete-last-n '(1 2 3 4 5) -1)	; (1 2 3 4 5)


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№11. Определите функцию, осуществляющую разделение исходного списка на два	;
;;;подсписка. В первый из них должно попасть указанное количество элементов	;
;;;с начала списка, во второй — оставшиеся элементы.				;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(defun separate-after-n (input-list n)
	(if input-list
		(if (zerop n)
			(cons nil (cons input-list nil))
   ((lambda (elem result)
     (cons
      (cons elem (car result))
      (cdr result)))
    (car input-list)
    (separate-after-n (cdr input-list) (1- n)))))
)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(separate-after-n '(1 2 3 4 5) 0)	; (NIL (1 2 3 4 5))
(separate-after-n '(1 2 3 4 5) 1)	; ((1) (2 3 4 5))
(separate-after-n '(1 2 3 4 5) 2)	; ((1 2) (3 4 5))
(separate-after-n '(1 2 3 4 5) 3)	; ((1 2 3) (4 5))
(separate-after-n '(1 2 3 4 5) 4)	; ((1 2 3 4) (5))
(separate-after-n '(1 2 3 4 5) 5)	; ((1 2 3 4 5))
(separate-after-n '(1 2 3 4 5) 6)	; ((1 2 3 4 5))
(separate-after-n '(1 2 3 4 5) -1)	; ((1 2 3 4 5))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№14. Определите функцию, осуществляющую перестановку двух элементов списка	;
;;;с заданными номерами.							;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun get-range-start-end (input-list st end) 
  (cond ((zerop end) nil)
        ((and (= st 1) (> end 0)) (cons (car input-list) (get-range-start-end (cdr input-list) 1 (1- end))))
        (t (get-range-start-end (cdr input-list) (1- st) end))))
 
(defun swap (input-list n1 n2)
  (cond ((= n1 n2) input-list)
        ((> n1 n2) (swap input-list n2 n1))
        (t 
            (append (get-range-start-end input-list 1 (- n1 1))
					(list (car (get-range-start-end input-list n2 (- (length input-list) n2 -1))))
					(cdr (get-range-start-end input-list n1 (- n2 n1)))
					(list (car (get-range-start-end input-list n1 (- n2 n1))))
					(cdr (get-range-start-end input-list n2 (- (length input-list) n2 -1)))))))

(swap `(1 2 3 4 5) 2 4)		; (1 4 3 2 5)
(swap `(1 2 3 4 5) 1 2)		; (2 1 3 4 5)
(swap `(1 2 3 4 5) 3 1)		; (3 2 1 4 5)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№18. Определите предикат, проверяющий, является ли аргумент одноуровневым	;
;;;списком.									;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun flatlistp(input-list)
	(cond 	((null (car input-list)) t)
			((not (atom (car input-list))) nil)
			(t (flatlistp (cdr input-list)))
	)
)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(flatlistp '(1 2 3 4))		; T
(flatlistp '((1 2) 3 4))		; NIL
(flatlistp '((1) 2 3 4))		; NIL
(flatlistp `(1 2 (3) 4))		; NIL

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№22. Определите функцию, которая обращает список (а b с) и разбивает его на	;
;;;уровни (((с) b) а).								;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(defun nest-and-reverse (input-list)
(cond 	((null input-list) nil)
		(t 
		((lambda (elem result)
			(cond ((null result) (list elem))
			(t (cons 
				(cons (car result) (cdr result)) (list elem)))))
			(car input-list)
			(nest-and-reverse (cdr input-list)))
		)
	)
)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(nest-and-reverse `())		; NIL
(nest-and-reverse `(1))		; (1)
(nest-and-reverse `(1 2))		; ((2) 1)
(nest-and-reverse `(1 2 3 4))	; ((((4) 3) 2) 1) 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№26. Определите функцию, разбивающую список (a b с d...) на пары ((а b) (с	;
;;;d)...).									;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№27. Определите функцию, которая, чередуя элементы списков (a b...) и 	;
;;;(1 2...), образует новый список (a 1 b 2 ...).				;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№29. Определите функцию, вычисляющую глубину списка (самой глубокой ветви)	;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№46. Предположим, что отец и мать некоторого лица, хранятся как значения со-	;
;;;ответствующих свойств у символа, обозначающего это лицо. Напишите функ-	;
;;;цию (РОДИТЕЛИ x), которая возвращает в качестве значения родителей, и пре-	;
;;;дикат (СЕСТРЫ-БРАТЬЯ x1 x2), который истинен в случае, если x1 и x2 — сест-	;
;;;ры или братья, родные или с одним общим родителем.				;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№47. Определите функцию УДАЛИТЬ-ВСЕ-СВОЙСТВА, которая удаляет все свойства	;
;;;символа.									;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;




