;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№1. Определите FUNCALL через функционал APPLY.                               ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN FC-CALL (FUNC &REST ARGS) (APPLY FUNC ARGS))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;                              Тест-кейсы:                                    ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(fc-call #'* 1 2 3)							;6
(fc-call #'+ 1 2 3)							;6
(fc-call #'list `(a b c) `(1 2 3))			;((A B C) (1 2 3))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№3. Определите функционал (APL-APPLY f x), который применяет каждую функцию  ;
;;;fi списка (f1 f2 ... fn) к соответствующему элементу списка                  ;
;;;x = (x1 x2 ... xn) и возвращает список, сформированный из результатов.       ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN APL-APPLY (FUNC-LIST EL-LIST)
  (COND ((NULL FUNC-LIST) NIL) ((NULL EL-LIST) NIL)
        (T
         (cons (FUNCALL (CAR FUNC-LIST) (CAR EL-LIST))
               (APL-APPLY (CDR FUNC-LIST) (CDR EL-LIST))))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;                              Тест-кейсы:                                    ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(apl-apply `(list cdr car) `((A B C) (1 2 3) (a1 b2 c3)))	;(((A B C)) (2 3) A1)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№5. Определите функциональный предикат (НЕКОТОРЫй пред список), который      ;
;;;истинен, когда, являющейся функциональным аргументом предикат пред истинен   ;
;;;хотя бы для одного элемента списка список.                                   ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN ATLIST1 (PRED LST)
  (NOT
   (NULL
    (MAPCAN
     #'(LAMBDA (X)
         (IF (FUNCALL PRED X)
             (LIST T)
             NIL))
     LST))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;                              Тест-кейсы:                                    ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(atlist1 'evenp '(1 3 5 7 9))   ; NIL
(atlist1 'evenp '(1 3 5 6 7 9)) ; T
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№7. Определите фильтр (УДАЛйЬ-ЕСЛИ-НЕ пред список), удаляющий из списка      ;
;;;список все элементы, которые не обладают свойством, наличие которого         ;
;;;проверяет предикат пред                                                      ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN DEL-IF (PRED LST)
  (MAPCAN
   #'(LAMBDA (X)
       (IF (FUNCALL PRED X)
           NIL
           (LIST X)))
   LST))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;                              Тест-кейсы:                                    ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(del-if #'oddp '(1 2 3 4 5)) ; (2 4)
(del-if #'zerop '(0 1 0 2 0 3)) ; (1 2 3)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№9. Напишите генератор порождения чисел Фибоначчи: 0, 1, 1, 2, 3, 5, ...     ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN FIBO ()
    (LET ((PREV 0)(CUR 1)(RES 1))
      (LAMBDA () (SETQ CUR (+ PREV CUR) PREV RES RES CUR))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;                              Тест-кейсы:                                    ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(setq c1 (fibo))
(c1)    ;1, 2, 3, 5, 8
(setq c2 (fibo))
(c2)    ;1, 2, 3, 5, 8
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№11. Определите фукнционал МНОГОФУН, который использует функции, являющиеся	;
;;;аргументами, по следующей схеме:                                             ;
;;;(МНОГОФУН ’(f g ... h) x) ⇔ (LIST (f x) (g x) ... (h x)).                   ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN MAP-FUNCTIONS (FUNCTION-LIST ARG)
  (MAPCAR #'(LAMBDA (FUNCT)
    (FUNCALL FUNCT ARG))
      FUNCTION-LIST))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;                              Тест-кейсы:                                    ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(MAP-FUNCTIONS '(EVENP ODDP) 10) ; (T NIL)
(MAP-FUNCTIONS '(CAR LIST CDR) '(1 2 3)) ; (1 ((1 2 3)) (2 3))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№13. Определите функцию, которая возвращает в качестве значения свое         ;
;;;определение (лямбда-выражение).                                              ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;



;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;                              Тест-кейсы:                                    ;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
