;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№10. Определите функцию, осуществляющую удаление указанного количества по-	;
;;;следних элементов исходного списка.						;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN DELETE-END (LIST)
  (COND ((NULL (CDR LIST)) NIL) (T (CONS (CAR LIST) (DELETE-END (CDR LIST))))))
  
(DEFUN DELETE-END (LIST)
  (COND ((NULL (CDR LIST)) NIL) (T (CONS (CAR LIST) (DELETE-END (CDR LIST))))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(delete-last-n '(1 2 3 4 5) 0)	; (1 2 3 4 5)
(delete-last-n '(1 2 3 4 5) 1)	; (1 2 3 4)
(delete-last-n '(1 2 3 4 5) 2)	; (1 2 3)
(delete-last-n '(1 2 3 4 5) 3)	; (1 2)
(delete-last-n '(1 2 3 4 5) 4)	; (1)
(delete-last-n '(1 2 3 4 5) 5)	; NIL
(delete-last-n '(1 2 3 4 5) 6)	; NIL
(delete-last-n '(1 2 3 4 5) -1)	; (1 2 3 4 5)


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№11. Определите функцию, осуществляющую разделение исходного списка на два	;
;;;подсписка. В первый из них должно попасть указанное количество элементов	;
;;;с начала списка, во второй — оставшиеся элементы.				;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(DEFUN SEPARATE-AFTER-N (INPUT-LIST N)
  (IF INPUT-LIST
      (IF (ZEROP N)
          (CONS NIL (CONS INPUT-LIST NIL))
          ((LAMBDA (ELEM RESULT) (CONS (CONS ELEM (CAR RESULT)) (CDR RESULT)))
           (CAR INPUT-LIST) (SEPARATE-AFTER-N (CDR INPUT-LIST) (1- N))))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(separate-after-n '(1 2 3 4 5) 0)	; (NIL (1 2 3 4 5))
(separate-after-n '(1 2 3 4 5) 1)	; ((1) (2 3 4 5))
(separate-after-n '(1 2 3 4 5) 2)	; ((1 2) (3 4 5))
(separate-after-n '(1 2 3 4 5) 3)	; ((1 2 3) (4 5))
(separate-after-n '(1 2 3 4 5) 4)	; ((1 2 3 4) (5))
(separate-after-n '(1 2 3 4 5) 5)	; ((1 2 3 4 5))
(separate-after-n '(1 2 3 4 5) 6)	; ((1 2 3 4 5))
(separate-after-n '(1 2 3 4 5) -1)	; ((1 2 3 4 5))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№14. Определите функцию, осуществляющую перестановку двух элементов списка	;
;;;с заданными номерами.							;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN GET-RANGE-START-END (INPUT-LIST ST END)
  (COND ((ZEROP END) NIL)
        ((AND (= ST 1) (> END 0))
         (CONS (CAR INPUT-LIST)
               (GET-RANGE-START-END (CDR INPUT-LIST) 1 (1- END))))
        (T (GET-RANGE-START-END (CDR INPUT-LIST) (1- ST) END))))
 
(DEFUN SWAP (INPUT-LIST N1 N2)
  (COND ((= N1 N2) INPUT-LIST) ((> N1 N2) (SWAP INPUT-LIST N2 N1))
        (T
         (APPEND (GET-RANGE-START-END INPUT-LIST 1 (- N1 1))
                 (LIST
                  (CAR
                   (GET-RANGE-START-END INPUT-LIST N2
                    (- (LENGTH INPUT-LIST) N2 -1))))
                 (CDR (GET-RANGE-START-END INPUT-LIST N1 (- N2 N1)))
                 (LIST (CAR (GET-RANGE-START-END INPUT-LIST N1 (- N2 N1))))
                 (CDR
                  (GET-RANGE-START-END INPUT-LIST N2
                   (- (LENGTH INPUT-LIST) N2 -1)))))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(swap `(1 2 3 4 5) 2 4)		; (1 4 3 2 5)
(swap `(1 2 3 4 5) 1 2)		; (2 1 3 4 5)
(swap `(1 2 3 4 5) 3 1)		; (3 2 1 4 5)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№18. Определите предикат, проверяющий, является ли аргумент одноуровневым	;
;;;списком.									;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN FLATLISTP (INPUT-LIST)
  (COND ((NULL (CAR INPUT-LIST)) T) ((NOT (ATOM (CAR INPUT-LIST))) NIL)
        (T (FLATLISTP (CDR INPUT-LIST)))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(flatlistp '(1 2 3 4))			; T
(flatlistp '((1 2) 3 4))		; NIL
(flatlistp '((1) 2 3 4))		; NIL
(flatlistp `(1 2 (3) 4))		; NIL

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№22. Определите функцию, которая обращает список (а b с) и разбивает его на	;
;;;уровни (((с) b) а).								;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN NEST-AND-REVERSE (INPUT-LIST)
  (COND ((NULL INPUT-LIST) NIL)
        (T
         ((LAMBDA (ELEM RESULT)
            (COND ((NULL RESULT) (LIST ELEM))
                  (T (CONS (CONS (CAR RESULT) (CDR RESULT)) (LIST ELEM)))))
          (CAR INPUT-LIST) (NEST-AND-REVERSE (CDR INPUT-LIST))))))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(nest-and-reverse `())		; NIL
(nest-and-reverse `(1))		; (1)
(nest-and-reverse `(1 2))	; ((2) 1)
(nest-and-reverse `(1 2 3 4))	; ((((4) 3) 2) 1) 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№26. Определите функцию, разбивающую список (a b с d...) на пары ((а b) (с	;
;;;d)...).									;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN PAIR (INPUT-LIST)
  (COND ((NULL INPUT-LIST) NIL)
        ((NULL (CDR INPUT-LIST)) (LIST (CAR INPUT-LIST)))
        (T
         (CONS (LIST (CAR INPUT-LIST) (CADR INPUT-LIST))
               (PAIR (CDDR INPUT-LIST))))))
			
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(pair `(1 2 3 4))	;((1 2) (3 4))
(pair `(1 2 3))		;((1 2) 3)
(pair `(1 2 3 4 5))	;((1 2) (3 4) 5)
(pair `())		;NIL
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№27. Определите функцию, которая, чередуя элементы списков (a b...) и 	;
;;;(1 2...), образует новый список (a 1 b 2 ...).				;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(DEFUN MERGE-ELEMENTS (INPUT-LIST1 INPUT-LIST2)
  (COND ((AND (NULL INPUT-LIST1) (NULL INPUT-LIST2)) NIL)
        (T
         (COND
          ((NULL INPUT-LIST1)
           (CONS (CAR INPUT-LIST2) (MERGE-ELEMENTS NIL (CDR INPUT-LIST2))))
          ((NULL INPUT-LIST2)
           (CONS (CAR INPUT-LIST1) (MERGE-ELEMENTS (CDR INPUT-LIST1) NIL)))
          (T
           (CONS (CAR INPUT-LIST1)
                 (CONS (CAR INPUT-LIST2)
                       (MERGE-ELEMENTS (CDR INPUT-LIST1)
                                       (CDR INPUT-LIST2)))))))))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(merge-elements `(1 2 3) `(a b c))		;(1 A 2 B 3 C)
(merge-elements `(1 2 3 4 5 6) `(a b c))	;(1 A 2 B 3 C 4 5)
(merge-elements `(1 2 3) `(a b c d e f))	;(1 A 2 B 3 C D E)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№29. Определите функцию, вычисляющую глубину списка (самой глубокой ветви)	;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№46. Предположим, что отец и мать некоторого лица, хранятся как значения со-	;
;;;ответствующих свойств у символа, обозначающего это лицо. Напишите функ-	;
;;;цию (РОДИТЕЛИ x), которая возвращает в качестве значения родителей, и пре-	;
;;;дикат (СЕСТРЫ-БРАТЬЯ x1 x2), который истинен в случае, если x1 и x2 — сест-	;
;;;ры или братья, родные или с одним общим родителем.				;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;№47. Определите функцию УДАЛИТЬ-ВСЕ-СВОЙСТВА, которая удаляет все свойства	;
;;;символа.									;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;				Тест-кейсы:					;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;




